InformationRegisters/EDR_ЗаказНаряды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_ЗаказНаряды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегАвтомобиля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РангАвторабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КлассыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СемействоАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СемействаАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтправленВСистему_GCM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>OTS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГотовностьКОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПовторнаяОтправка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/EDR_Invoices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_Invoices</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDR_КатегорииСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИнвойса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Expense_code</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDR_ВидыРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/EDR_Interventions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_Interventions</Name>
			<Comment>V_1_00_15</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>RC_code</Name>
					<Comment>Код ощущения клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.EDR_КодыОщущенийКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Function_Code</Name>
					<Comment>Группа деталей. по которой выполнялись работы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OTS_number</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисныеКампании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСФ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегПриУстановке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЖалобы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДиагностики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Intervention</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/EDR_РаботыДоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_РаботыДоп</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>GUID_Инцидента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаПоЛКМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаИзЗаказНаряда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Нормочас</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеНеСтандартнойОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID_Работы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DiversCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.EDR_DiversCode</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулНестандартнойОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/EDR_СоответствияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_СоответствияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Intervention</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Comment>Служебное поле, нужно для уникальности записей.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ВидыРемонтаДопРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ВидыРемонтаДопРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГарантияЗавода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EDR_ЛКМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЛКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/EDR_ОбщийМодульКлиентСервер/Ext/Module.bsl
Процедура Запись_ЗаказНаряда_в_регистр_при_записи(Источник, Отказ) Экспорт
	
	//Заказ наряд записывается несколько раз в течении работы над ним.
	//в регистры данные заносим только один раз. Поэтому проверяем наличие записи 
	//перед тем как делать новую запись.

	//Так же запись документа выполняется при его удалении (пометке на удаление)
	//В этом случае запись в регистры делать не нужно.
	Если Источник.ПометкаУдаления тогда Возврат КонецЕсли;

	//исходя из структуры локальной ИБ.
	ЭтоГарантия = ОпределитьГарантийнтиюЗавода(Источник);
	
	//Если это не гарантия то выходим ничего не записывая.
	Если НЕ ЭтоГарантия тогда возврат КонецЕсли;

	СостояниеДокумента = Источник.Состояние;
	
	СостояниеДляГарантии = Константы.Renault_СостояниеЗаказНарядаДляГарантии.Получить();
	
	Если СостояниеДокумента = СостояниеДляГарантии тогда  //Это уже не первая запись документа.
		
		//Регистр сведений EDR_ЗаказНаряд
		//Для начала найдем запись
		НЗ = РегистрыСведений.EDR_ЗаказНаряды.ЗаписьЗНСуществует(Источник.Ссылка);
		
		Если НЗ = Неопределено тогда
			
			// Комментарий 
			//Дата создания - 23.04.2012 11:00:28; Автор - Окипний Андрей Евгеньевич
			//В связи с парольной защитой модуля использовать команды препроцессору
			//нельзя, поэтому вызываем Открытый модуль
			// 
			Renault_Открытый.СообщитьПользователю("Запись для Заказ-наряда в регистре ""Заказ наряды для EDR"" не найдена.");
			Возврат
			
		КонецЕсли;
		
		ПробегАвтомобиля = ОпределитьПробегАвтомобиля(Источник.Ссылка);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ПробегАвтомобиля",ПробегАвтомобиля);
		СтруктураПараметров.Вставить("ДатаЗакрытия",?(ЗначениеЗаполнено(Источник.ДатаОкончания), Источник.ДатаОкончания, ТекущаяДата()));
		СтруктураПараметров.Вставить("Гарантия",ЭтоГарантия);
		СтруктураПараметров.Вставить("ДатаОткрытия",Источник.ДатаСоздания);
		
		//Запись в регистре есть, вносим в нее дополнителдьные данные и записываем.
		ВремТЗ = НЗ.Выгрузить();
		
		//Строка должна быть только одна, поэтому цикл только для упрощения кода.
		Для каждого стр из ВремТЗ Цикл
			
			ЗаполнитьЗначенияСвойств(стр,СтруктураПараметров);
			
		КонецЦикла;
		
		НЗ.Загрузить(ВремТЗ);
		НЗ.Записать();
		
		//Запись прочей обвязки
		
		GUID_Инвойса   = Неопределено;
		GUID_Инцидента = Неопределено;
		
		СозданСчет = ложь;
		СозданИнцидент = Ложь;
		
		//Создаем Инвойс, если их еще не было
		Если НЕ РегистрыСведений.EDR_Invoices.ИнвойсыСуществуют(Источник.Ссылка) тогда
			
			//Этот параметр необходимо реализовать программистам дилера
			//исходя из структуры локальной ИБ.
			ЭтоОтзывнаяНота = ОпределитьОтзывнуюНоту(Источник);
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("ЗаказНаряд",Источник.Ссылка);
			
			НомерДокумента = "" + EDR_КешируемыеЗначения.ПолучитьНомерДляПечати(Источник.Ссылка) +"A";
			
			СтруктураПараметров.Вставить("Invoice",НомерДокумента);
			СтруктураПараметров.Вставить("ДатаИнвойса",Источник.Дата);
			
			//%+ Дата изменения - 03.07.2012 17:56:10; Автор - Окипний Андрей Евгеньевич
			//
			// Описание изменений
			//  Добавлен алгоритм заполнения категории и кода расходов для ОТО
			//
			//%-
			Если ЗначениеЗаполнено(Источник.СервиснаяКампания) тогда
				СтруктураПараметров.Вставить("Категория", Справочники.EDR_КатегорииСчетов.RenaultWarranty);
				СтруктураПараметров.Вставить("Expense_code", Справочники.EDR_ВидыРасходов.Ex91);
			КонецЕсли;
				
			GUID_Инвойса = РегистрыСведений.EDR_Invoices.СоздатьИнвойс(СтруктураПараметров);
			СозданСчет = Истина;
			
		КонецЕсли;
		
		//Теперь проверим Инциденты, если их нет, то создадим как минимум один инцидент.
		Если НЕ РегистрыСведений.EDR_Interventions.ИнцидентыСуществуют(Источник.Ссылка) тогда
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("ЗаказНаряд", Источник.Ссылка);
			СтруктураПараметров.Вставить("Intervention", "A");
			СтруктураПараметров.Вставить("OTS_number", 
			?(ЗначениеЗаполнено(Источник.СервиснаяКампания),Источник.СервиснаяКампания,""));
			
			GUID_Инцидента = РегистрыСведений.EDR_Interventions.СоздатьИнцидент(СтруктураПараметров);
			
			//Теперь Регистр сведений EDR_РаботыДоп 
			//Преобразуем таблицу
			ВремРаботы = Источник.Работы.Выгрузить();
			//ВремРаботы.Колонки.GUID.Имя = "GUID_Работы";
			
			//Добавлено: phsin 01.12.2014 
			//ВремРаботы.Колонки.Добавить("GUID_Работы");
			ВремРаботы.Колонки.ИдентификаторРаботы.Имя = "GUID_Работы";
			
			ВремРаботы.Колонки.Добавить("ЗаказНаряд");
			ВремРаботы.Колонки.Добавить("GUID_Инцидента");
			ВремРаботы.Колонки.Добавить("СтрокаИзЗаказНаряда");
			ВремРаботы.ЗаполнитьЗначения(Источник.Ссылка,"ЗаказНаряд");
			ВремРаботы.ЗаполнитьЗначения(GUID_Инцидента,"GUID_Инцидента");
			ВремРаботы.ЗаполнитьЗначения(Истина,"СтрокаИзЗаказНаряда");
			ВремРаботы = ВремРаботы.Скопировать(,"GUID_Работы,ЗаказНаряд,GUID_Инцидента,СтрокаИзЗаказНаряда");
			
			////Добавлено: phsin 01.12.2014 
			//ЗаполнитьGUIDРабот(ВремРаботы);
			
			//Теперь Передаем таблицу в менеджер регистра и записываем
			ВремРаботы.Свернуть("GUID_Работы,ЗаказНаряд,GUID_Инцидента,СтрокаИзЗаказНаряда");
			Результат = РегистрыСведений.EDR_РаботыДоп.ЗаписатьРаботы(ВремРаботы);
			
			//Теперь Регистр сведений EDR_ТоварыДоп 
			ВремТовары = Источник.Товары.Выгрузить();
			//Удалено: phsin 01.12.2014 
			//ВремТовары.Колонки.GUID.Имя = "GUID_Товара";
			/// phsin 01.12.2014 
			
			//Добавлено: phsin 01.12.2014 
			//ВремТовары.Колонки.Добавить("GUID_Товара");
			
			ВремТовары.Колонки.Добавить("ЗаказНаряд");
			ВремТовары.Колонки.Добавить("GUID_Инцидента");
			ВремТовары.Колонки.Добавить("СтрокаИзЗаказНаряда");
			ВремТовары.ЗаполнитьЗначения(Источник.Ссылка,"ЗаказНаряд");
			ВремТовары.ЗаполнитьЗначения(GUID_Инцидента,"GUID_Инцидента");
			ВремТовары.ЗаполнитьЗначения(Истина,"СтрокаИзЗаказНаряда");
			
			////Добавлено: phsin 01.12.2014 
			//ЗаполнитьGUIDТоваров(ВремТовары);
			ВремТовары = ВремТовары.Скопировать(,"Номенклатура,ЗаказНаряд,GUID_Инцидента,СтрокаИзЗаказНаряда");
			
			//Теперь Передаем таблицу в менеджер регистра и записываем
			ВремТовары.Свернуть("Номенклатура,ЗаказНаряд,GUID_Инцидента,СтрокаИзЗаказНаряда");
			Результат = РегистрыСведений.EDR_ТоварыДоп.ЗаписатьТовары(ВремТовары);
			
			СозданИнцидент = Истина;
			
		КонецЕсли;
		
		//Формируем запись соответствия
		Если СозданСчет и СозданИнцидент тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ЗаказНаряд", Источник.Ссылка);
			СтруктураПараметров.Вставить("GUID",GUID_Инцидента);
			СтруктураПараметров.Вставить("GUID_Invoice",GUID_Инвойса);
			СтруктураПараметров.Вставить("Процент",100);
			
			РегистрыСведений.EDR_СоответствияИнвойсов.ЗаписатьСоответствие(СтруктураПараметров);
			
		КонецЕсли;
		
	Иначе //Документ не в том статусе. Скорее всего первая запись документа.
		
		//Заказ наряд записывается несколько раз в течении работы над ним.
		//в регистр данные заносим только один раз. Поэтому проверяем наличие записи 
		//перед тем как делать новую запись.
		ТолькоПризнак = Истина;
		Если РегистрыСведений.EDR_ЗаказНаряды.ЗаписьЗНСуществует(Источник.Ссылка,ТолькоПризнак) тогда
			
			Возврат
			
		КонецЕсли;
		
		//Этот параметр необходимо реализовать программистам дилера
		//исходя из структуры локальной ИБ.
		ЭтоОтзывнаяНота = ОпределитьОтзывнуюНоту(Источник);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗаказНаряд", Источник.Ссылка);
		СтруктураПараметров.Вставить("OTS",ЭтоОтзывнаяНота);
		СтруктураПараметров.Вставить("Гарнтия", ЭтоГарантия);
		СтруктураПараметров.Вставить("СемействоАвтомобиля", РегистрыСведений.Renault_АвтомобилиДопРеквизиты.ПолучитьСемействоАвтомобиля(  Источник.Автомобиль) );
		СтруктураПараметров.Вставить("РангАвторабот", РегистрыСведений.Renault_АвтомобилиДопРеквизиты.ПолучитьСемействоАвтомобиля(  Источник.Автомобиль).КлассАвтомобиля);
		
		СтруктураПараметров.Вставить("GUID", Новый УникальныйИдентификатор());
		
		РегистрыСведений.EDR_ЗаказНаряды.ЗаписатьНовыйЗаказНарядВРегистр(СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура EDR_УдалениеДокумента_ЗаказНарядПередУдалением(Источник, Отказ) Экспорт
	
	//Получаем ссылку на заказ.
	СсылкаНаЗаказ = Источник.Ссылка;
	
	//Удаляем записи из регистров EDR
	РегистрыСведений.EDR_СоответствияИнвойсов.УдалитьЗаписиПоЗаказНаряду(СсылкаНаЗаказ);
	
	РегистрыСведений.EDR_РаботыДоп.УдалитьЗаписиПоЗаказНаряду(СсылкаНаЗаказ);
	РегистрыСведений.EDR_ТоварыДоп.УдалитьЗаписиПоЗаказНаряду(СсылкаНаЗаказ);
	
	РегистрыСведений.EDR_Interventions.УдалитьЗаписиПоЗаказНаряду(СсылкаНаЗаказ);
	РегистрыСведений.EDR_Invoices.УдалитьЗаписиПоЗаказНаряду(СсылкаНаЗаказ);
	
	РегистрыСведений.EDR_ЗаказНаряды.УдалитьЗаписиПоЗаказНаряду(СсылкаНаЗаказ);
	
КонецПроцедуры

//Эту процедуру нужно реализовать программистам дилерского цента 
//исходя из структуры используемой ИБ
Функция ОпределитьГарантийнтиюЗавода(Источник)
	
	//Изменено: phsin 28.11.2014 
	//Если Источник.ВидРемонта.ГарантияЗавода тогда возврат Истина Иначе Возврат Ложь КонецЕсли;
	//---- Заменено на: ----
	ГарантияЗавода = РегистрыСведений.Renault_ВидыРемонтаДопРеквизиты.ПолучитьГарантиюЗавода(Источник.ВидРемонта);
	возврат ГарантияЗавода;
	/// phsin 28.11.2014 
	
КонецФункции

//Нужно получить пробег автомобиля на дату заказ наряда
Функция ОпределитьПробегАвтомобиля(Источник)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	АвтомобилиСрезПоследних.Значение как пробег
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних(
	|			&ДатаЗаказа,
	|			Автомобиль = &Автомобиль
	|				И ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)) КАК АвтомобилиСрезПоследних");
	Запрос.УстановитьПараметр("Автомобиль",Источник.Автомобиль);
	Запрос.УстановитьПараметр("ДатаЗаказа",КонецДня(Источник.Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() тогда
		Возврат Выборка.Пробег;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

//Эту процедуру нужно реализовать программистам дилерского цента 
//исходя из структуры используемой ИБ
Функция ОпределитьОтзывнуюНоту(Источник)
	
	Если ЗначениеЗаполнено(Источник.СервиснаяКампания) тогда возврат Истина Иначе Возврат Ложь КонецЕсли;
	
КонецФункции
